Revit 2027 API
SymbolTypeId.Yen Property
 Symbol ¥, indicating unit Currency.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Yen { get; }
Public Shared ReadOnly Property Yen As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Yen {
	ForgeTypeId^ get ();
}
static member Yen : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace